{
  "format": "layers-model",
  "generatedBy": "TensorFlow.js v4.22.0",
  "convertedBy": "TensorFlow.js Converter",
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "name": "dense",
            "trainable": true,
            "dtype": "float32",
            "batch_input_shape": [null, 100],
            "units": 64,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {"seed": null}
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_1",
            "trainable": true,
            "dtype": "float32",
            "units": 32,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {"seed": null}
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_2",
            "trainable": true,
            "dtype": "float32",
            "units": 1,
            "activation": "sigmoid",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {"seed": null}
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        }
      ]
    },
    "keras_version": "2.15.0",
    "backend": "tensorflow"
  },
  "weightsManifest": [
    {
      "paths": ["weights.bin"],
      "weights": [
        {"name": "dense/kernel", "shape": [100, 64], "dtype": "float32"},
        {"name": "dense/bias", "shape": [64], "dtype": "float32"},
        {"name": "dense_1/kernel", "shape": [64, 32], "dtype": "float32"},
        {"name": "dense_1/bias", "shape": [32], "dtype": "float32"},
        {"name": "dense_2/kernel", "shape": [32, 1], "dtype": "float32"},
        {"name": "dense_2/bias", "shape": [1], "dtype": "float32"}
      ]
    }
  ]
}

